---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.WireSizeSetIterator
source: html/bcfdf3c4-020b-1fb9-cabb-5b4313b771ca.htm
---
# WireSizeSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.